In [251]:
# Load pandas, numpy, matplotlib
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
# improt chain from itertools
from itertools import chain



# Load the daily report to a data frame
df = pd.read_json('soal-2.json')

# View summary stats about pop_in_shelters
print(df.describe())

       komoditas berat
count       1054  1054
unique       437   400
top         lele   3kg
freq         192    64

In [252]:
df.head()

,komoditas,berat
0,"lele, bawal, nila","lele 6kg, bawal 1kg, nila 1kg"
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,"ikan nila, kakap, lele, bawal, kembung, salam",rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,"lele, kerapu, ikan mas, pindang tongkol, gurame",rata2 1kg

`Note`: 
this data separate with whitespace and commas, so you have to make separate function and run twice each

In [253]:
df

,komoditas,berat
0,"lele, bawal, nila","lele 6kg, bawal 1kg, nila 1kg"
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,"ikan nila, kakap, lele, bawal, kembung, salam",rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,"lele, kerapu, ikan mas, pindang tongkol, gurame",rata2 1kg
...,...,...
1049,ikan lele,3kg
1050,"mas, mujaer","5,5"
1051,"ikan mas, lele, bawal, mujair",5
1052,"tongkol, nila","4,5"
1053,"ikan mas, lele,tongkol",4kg

In [254]:
print(df.head())

                                         komoditas  \
0                                lele, bawal, nila
1                 kakap lele kembung tongkol salem
2    ikan nila, kakap, lele, bawal, kembung, salam
3                  nila kembung tongkol lele bawal
4  lele, kerapu, ikan mas, pindang tongkol, gurame

                                               berat
0                      lele 6kg, bawal 1kg, nila 1kg
1  kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2                      rata2 1kg kecuali kembung 2kg
3  nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4                                          rata2 1kg

0                           lele 6kg, bawal 1kg, nila 1kg
1       kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2                           rata2 1kg kecuali kembung 2kg
3       nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4                                               rata2 1kg
                              ...
1049                                                  3kg
1050                                                  5,5
1051                                                    5
1052                                                  4,5
1053                                                  4kg
Name: berat, Length: 1054, dtype: object

In [255]:
df.head()

,komoditas,berat
0,"lele, bawal, nila","lele 6kg, bawal 1kg, nila 1kg"
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,"ikan nila, kakap, lele, bawal, kembung, salam",rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,"lele, kerapu, ikan mas, pindang tongkol, gurame",rata2 1kg

In [257]:
# print the length of splits
lens = df['komoditas'].str.split(',').map(len)

In [258]:
print(lens)

0       3
1       1
2       6
3       1
4       5
       ..
1049    1
1050    2
1051    4
1052    2
1053    3
Name: komoditas, Length: 1054, dtype: int64

In [259]:
# make the fuction to chain the iterable split of the rows
def chainer(s): 
    return list(chain.from_iterable(s.str.split(',')))

In [260]:
# creating the new dataframe, and repneating or chaining as appropriate

In [261]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054 entries, 0 to 1053
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   komoditas  1054 non-null   object
 1   berat      1054 non-null   object
dtypes: object(2)
memory usage: 16.6+ KB

In [262]:
# convert to excel to see the whole data describtive
df.to_excel("output_efishery_task2.xlsx")

# delete unnecessary data
if the content not the same lengt > delete

In [263]:
lens_berat = df['berat'].str.split(',').map(len)

lens_komoditas = df['komoditas'].str.split(',').map(len)

In [264]:
lens_berat

0       3
1       1
2       1
3       1
4       1
       ..
1049    1
1050    2
1051    1
1052    2
1053    1
Name: berat, Length: 1054, dtype: int64

In [265]:
lens_komoditas

0       3
1       1
2       6
3       1
4       5
       ..
1049    1
1050    2
1051    4
1052    2
1053    3
Name: komoditas, Length: 1054, dtype: int64

if the program doesnt meet the require conditions, so delete it

# replace commas with whitespace

In [266]:
# replace comma with whitespace 
df2 = df.apply(lambda x: x.str.replace(', ', ' '))

In [267]:
# replace comma with whitespace again
df2 = df2.apply(lambda x: x.str.replace(',', ' '))

In [268]:
df2

,komoditas,berat
0,lele bawal nila,lele 6kg bawal 1kg nila 1kg
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,ikan nila kakap lele bawal kembung salam,rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,lele kerapu ikan mas pindang tongkol gurame,rata2 1kg
...,...,...
1049,ikan lele,3kg
1050,mas mujaer,5 5
1051,ikan mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,ikan mas lele tongkol,4kg

In [269]:
# delete ikan string replace with white space
df2 = df2.apply(lambda x: x.str.replace('ikan', ''))

In [270]:
df2

,komoditas,berat
0,lele bawal nila,lele 6kg bawal 1kg nila 1kg
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,nila kakap lele bawal kembung salam,rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,lele kerapu mas pindang tongkol gurame,rata2 1kg
...,...,...
1049,lele,3kg
1050,mas mujaer,5 5
1051,mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,mas lele tongkol,4kg

In [271]:
# remove kg 
df2 = df2.apply(lambda x: x.str.replace('kg', ' '))

In [272]:
df2

,komoditas,berat
0,lele bawal nila,lele 6 bawal 1 nila 1
1,kakap lele kembung tongkol salem,kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,nila kakap lele bawal kembung salam,rata2 1 kecuali kembung 2
3,nila kembung tongkol lele bawal,nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,lele kerapu mas pindang tongkol gurame,rata2 1
...,...,...
1049,lele,3
1050,mas mujaer,5 5
1051,mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,mas lele tongkol,4

In [273]:
df2

,komoditas,berat
0,lele bawal nila,lele 6 bawal 1 nila 1
1,kakap lele kembung tongkol salem,kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,nila kakap lele bawal kembung salam,rata2 1 kecuali kembung 2
3,nila kembung tongkol lele bawal,nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,lele kerapu mas pindang tongkol gurame,rata2 1
...,...,...
1049,lele,3
1050,mas mujaer,5 5
1051,mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,mas lele tongkol,4

In [274]:
df2.explode('komoditas')

,komoditas,berat
0,lele bawal nila,lele 6 bawal 1 nila 1
1,kakap lele kembung tongkol salem,kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,nila kakap lele bawal kembung salam,rata2 1 kecuali kembung 2
3,nila kembung tongkol lele bawal,nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,lele kerapu mas pindang tongkol gurame,rata2 1
...,...,...
1049,lele,3
1050,mas mujaer,5 5
1051,mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,mas lele tongkol,4

In [275]:
df2['komoditas'] = df2['komoditas'].str.split()

In [276]:
df2

,komoditas,berat
0,"[lele, bawal, nila]",lele 6 bawal 1 nila 1
1,"[kakap, lele, kembung, tongkol, salem]",kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,"[nila, kakap, lele, bawal, kembung, salam]",rata2 1 kecuali kembung 2
3,"[nila, kembung, tongkol, lele, bawal]",nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,"[lele, kerapu, mas, pindang, tongkol, gurame]",rata2 1
...,...,...
1049,[lele],3
1050,"[mas, mujaer]",5 5
1051,"[mas, lele, bawal, mujair]",5
1052,"[tongkol, nila]",4 5
1053,"[mas, lele, tongkol]",4

In [297]:
df2

,komoditas,berat
0,"[lele, bawal, nila]",lele 6 bawal 1 nila 1
1,"[kakap, lele, kembung, tongkol, salem]",kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,"[nila, kakap, lele, bawal, kembung, salam]",rata2 1 kecuali kembung 2
3,"[nila, kembung, tongkol, lele, bawal]",nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,"[lele, kerapu, mas, pindang, tongkol, gurame]",rata2 1
...,...,...
1049,[lele],3
1050,"[mas, mujaer]",5 5
1051,"[mas, lele, bawal, mujair]",5
1052,"[tongkol, nila]",4 5
1053,"[mas, lele, tongkol]",4

In [278]:
df2.explode('komoditas')

     komoditas                                            berat
0         lele                         lele 6  bawal 1  nila 1
0        bawal                         lele 6  bawal 1  nila 1
0         nila                         lele 6  bawal 1  nila 1
1        kakap  kakap 2  lele 1  kembung 1  tongkol 1  salem 1
1         lele  kakap 2  lele 1  kembung 1  tongkol 1  salem 1
...        ...                                              ...
1052   tongkol                                              4 5
1052      nila                                              4 5
1053       mas                                               4
1053      lele                                               4
1053   tongkol                                               4

[2556 rows x 2 columns]

# using re to remove unecessary komoditas on berat, using this regex

In [282]:
import re

In [284]:
df2

,komoditas,berat
0,"[lele, bawal, nila]",lele 6 bawal 1 nila 1
1,"[kakap, lele, kembung, tongkol, salem]",kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,"[nila, kakap, lele, bawal, kembung, salam]",rata2 1 kecuali kembung 2
3,"[nila, kembung, tongkol, lele, bawal]",nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,"[lele, kerapu, mas, pindang, tongkol, gurame]",rata2 1
...,...,...
1049,[lele],3
1050,"[mas, mujaer]",5 5
1051,"[mas, lele, bawal, mujair]",5
1052,"[tongkol, nila]",4 5
1053,"[mas, lele, tongkol]",4

In [294]:
To_remove_lst = ["lele", "bawal", "tongkol", "salem", "rata2", "kembung", "kecuali", "kakap", "nila"]

In [300]:
# remove list using regex (regular expression)
df2['berat'] = df2['berat'].str.replace('|'.join(map(re.escape, To_remove_lst)), '')

In [301]:
df2

                                          komoditas                berat
0                               [lele, bawal, nila]           6   1   1
1            [kakap, lele, kembung, tongkol, salem]   2   1   1   1   1
2        [nila, kakap, lele, bawal, kembung, salam]              1    2
3             [nila, kembung, tongkol, lele, bawal]   1   2   5   2   3
4     [lele, kerapu, mas, pindang, tongkol, gurame]                   1
...                                             ...                  ...
1049                                         [lele]                   3
1050                                  [mas, mujaer]                  5 5
1051                     [mas, lele, bawal, mujair]                    5
1052                                [tongkol, nila]                  4 5
1053                           [mas, lele, tongkol]                   4

[1054 rows x 2 columns]

In [304]:
df2.to_excel("unclean_data_fish.xlsx")

`Note`: this done for removing unnescessary string usign regex but, the problem is how to make function to explode each with special conditions, for insance is, multiple list with single list on a rows